server/2018-04-24_20-54-18.135533/taurus.yml
execution:
- executor: siege
  concurrency: 100
  hold-for: 1m
  scenario: external_urls

reporting:
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  failed-labels: true  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-csv: dump.csv

scenarios:
  external_urls:
    think-time: 15s
    requests:
    - 'https://www.qa.rent.com'